Комплексная_автоматизация_2_МОМ_2019/src/Catalogs/РодственникиФизическихЛиц/РодственникиФизическихЛиц.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>РодственникиФизическихЛиц</name>
  <owners>Catalog.ФизическиеЛица</owners>
  <attributes>
    <name>СтепеньРодства</name>
    <type>
      <types>CatalogRef.СтепениРодстваФизическихЛиц</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаИждивении</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеСлужебное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СкрыватьВТ2</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Комплексная_автоматизация_2_МОМ_2019/src/Catalogs/РодственникиФизическихЛиц/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Владелец)";
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Формирует таблицу с составом семьи.
// Члены семьи упорядочиваются по коду степени родства и возрасту и отделяются переносом строки.
//
// Параметры:
//  ФизическоеЛицо	 - СправочникСсылка.ФизическиеЛица - человек, состав семьи которого формируется.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - таблица с колонками
//		Ссылка - СправочникСсылка.РодственникиФизическихЛиц - ссылка на члена семьи,
//		Наименование - Строка - наименование элемента справочника родственников,
//		СтепеньРодства - СправочникСсылка.СтепениРодстваФизическихЛиц - степени родства физических лиц,
//		ДатаРождения - Дата - дата рождения родственника,
//		НаИждивении - Булево - признак того, что родственник находится на иждивении,
//		СкрыватьВТ2 - Булево - признак того, что родственник скрывается из формы Т-2.
//
Функция СоставСемьи(ФизическоеЛицо) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ФизическоеЛицо", ФизическоеЛицо);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РодственникиФизическихЛиц.Ссылка КАК Ссылка,
		|	РодственникиФизическихЛиц.Наименование КАК Наименование,
		|	РодственникиФизическихЛиц.СтепеньРодства КАК СтепеньРодства,
		|	РодственникиФизическихЛиц.ДатаРождения КАК ДатаРождения,
		|	РодственникиФизическихЛиц.НаИждивении КАК НаИждивении,
		|	РодственникиФизическихЛиц.СкрыватьВТ2 КАК СкрыватьВТ2,
		|	РодственникиФизическихЛиц.СтепеньРодства.Код КАК СтепеньРодстваКод
		|ИЗ
		|	Справочник.РодственникиФизическихЛиц КАК РодственникиФизическихЛиц
		|ГДЕ
		|	РодственникиФизическихЛиц.Владелец = &ФизическоеЛицо
		|	И НЕ РодственникиФизическихЛиц.ПометкаУдаления
		|
		|УПОРЯДОЧИТЬ ПО
		|	СтепеньРодстваКод";
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

// Формирует строку с представлением состава семьи.
//
// Параметры:
//  ФизическоеЛицо	 - СправочникСсылка.ФизическиеЛица - человек, состав семьи которого формируется.
//  ВключатьСкрытыхИзТ2	 - Булево - необязательный, по умолчанию Ложь.
//		Если установлено, то состав семьи будет сформирован с учетом лиц, скрываемых из формы Т-2.
// 
// Возвращаемое значение:
//  Строка - представление состава семьи.
//
// Пример:
//	Муж: Виктор, 51 год
//	Сын: Орлов Александр, 29 лет
//	Дочь: Орлова Мария, 26 лет
//
Функция ПредставлениеСоставаСемьи(ФизическоеЛицо, ВключатьСкрытыхИзТ2 = Ложь) Экспорт
	
	Представление = "";
	
	СоставСемьи = СоставСемьи(ФизическоеЛицо);
	Для Каждого ЧленСемьи Из СоставСемьи Цикл
		Если Не ВключатьСкрытыхИзТ2 И ЧленСемьи.СкрыватьВТ2 Тогда
			Продолжить;
		КонецЕсли;
		Если Не ПустаяСтрока(Представление) Тогда
			Представление = Представление + Символы.ПС;
		КонецЕсли;
		Если ЗначениеЗаполнено(ЧленСемьи.СтепеньРодства) Тогда
			Представление = Представление + Строка(ЧленСемьи.СтепеньРодства) + ": ";
		КонецЕсли;
		Представление = Представление + СокрЛП(Строка(ЧленСемьи.Наименование));
		Если ЗначениеЗаполнено(ЧленСемьи.ДатаРождения) Тогда
			Представление = Представление + ", " + ФизическиеЛицаЗарплатаКадры.ПредставлениеВозраста(ЧленСемьи.ДатаРождения);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Представление;
	
КонецФункции

#КонецОбласти

#КонецЕсли
